jpietari/VME-SAM3X/src/ASF/sam/boards/sam3x_evm300/sam3x_evm300.h
/**
 * \file
 *
 * \brief SAM3X-EVM300 Board Definition.
 *
 * Copyright (c) 2011-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAM3X_EVM300_H_
#define _SAM3X_EVM300_H_

#include "compiler.h"
#include "system_sam3x.h"
#include "exceptions.h"

/*#define BOARD_REV_A */
#define BOARD_REV_1_1

/* ------------------------------------------------------------------------ */

/**
 *  \page sam3x_evm300_opfreq "SAM3X-EVM300 - Operating frequencies"
 *  This page lists several definition related to the board operating frequency
 *
 *  \section Definitions
 *  - \ref BOARD_FREQ_*
 *  - \ref BOARD_MCK
 */

/*! Board oscillator settings */
#define BOARD_FREQ_SLCK_XTAL            (32768U)
#define BOARD_FREQ_SLCK_BYPASS          (32768U)
#define BOARD_FREQ_MAINCK_XTAL          (12000000U)
#define BOARD_FREQ_MAINCK_BYPASS        (12000000U)

/*! Master clock frequency */
#define BOARD_MCK                       CHIP_FREQ_CPU_MAX

/** board main clock xtal startup time */
#define BOARD_OSC_STARTUP_US   15625

/* ------------------------------------------------------------------------ */

/**
 * \page sam3x_evm300_board_info "SAM3X-EVM300 - Board informations"
 * This page lists several definition related to the board description.
 *
 * \section Definitions
 * - \ref BOARD_NAME
 */

/*! Name of the board */
#define BOARD_NAME "SAM3X-EVM300"
/*! Board definition */
#define sam3xek
/*! Family definition (already defined) */
#define sam3x
/*! Core definition */
#define cortexm3

/* ------------------------------------------------------------------------ */

/**
 * \page sam3x_evm300_piodef "SAM3X-EVM300 - PIO definitions"
 * This pages lists all the pio definitions. The constants
 * are named using the following convention: PIN_* for a constant which defines
 * a single Pin instance (but may include several PIOs sharing the same
 * controller), and PINS_* for a list of Pin instances.
 *
 */

/**
 * \file
 * ADC
 */

/*! ADC pin definition. */
#define PINS_ADC_TRIG  PIO_PA11_IDX
#define PINS_ADC_TRIG_FLAG  (PIO_PERIPH_B | PIO_DEFAULT)

/**
 * \file
 * EBI
 * - \ref PIN_EBI_DATA_BUS
 * - \ref PIN_EBI_NRD
 * - \ref PIN_EBI_NWE
 * - \ref PIN_EBI_NCS0
 * - \ref PIN_EBI_PSRAM_ADDR_BUS
 * - \ref PIN_EBI_PSRAM_NBS
 * - \ref PIN_EBI_A1
 * - \ref PIN_EBI_NCS1
 * - \ref PIN_EBI_LCD_RS
 *
 */

/* ------------------------------------------------------------------------ */
/* EBI */
/* ------------------------------------------------------------------------ */
/*! EBI Data Bus pins */
#define PIN_EBI_DATA_BUS_D0       PIO_PC2_IDX
#define PIN_EBI_DATA_BUS_D1       PIO_PC3_IDX
#define PIN_EBI_DATA_BUS_D2       PIO_PC4_IDX
#define PIN_EBI_DATA_BUS_D3       PIO_PC5_IDX
#define PIN_EBI_DATA_BUS_D4       PIO_PC6_IDX
#define PIN_EBI_DATA_BUS_D5       PIO_PC7_IDX
#define PIN_EBI_DATA_BUS_D6       PIO_PC8_IDX
#define PIN_EBI_DATA_BUS_D7       PIO_PC9_IDX
#define PIN_EBI_DATA_BUS_D8       PIO_PC10_IDX
#define PIN_EBI_DATA_BUS_D9       PIO_PC11_IDX
#define PIN_EBI_DATA_BUS_D10      PIO_PC12_IDX
#define PIN_EBI_DATA_BUS_D11      PIO_PC13_IDX
#define PIN_EBI_DATA_BUS_D12      PIO_PC14_IDX
#define PIN_EBI_DATA_BUS_D13      PIO_PC15_IDX
#define PIN_EBI_DATA_BUS_D14      PIO_PC16_IDX
#define PIN_EBI_DATA_BUS_D15      PIO_PC17_IDX
#define PIN_EBI_DATA_BUS_FLAGS    (PIO_PERIPH_A | PIO_PULLUP)
/*! EBI NRD pin */
#define PIN_EBI_NRD            PIO_PA29_IDX
#define PIN_EBI_NRD_FLAGS      (PIO_PERIPH_B | PIO_PULLUP)
#define PIN_EBI_NRD_MASK       (1 << 29)
#define PIN_EBI_NRD_PIO        PIOA
#define PIN_EBI_NRD_ID         ID_PIOA
#define PIN_EBI_NRD_TYPE       PIO_PERIPH_B
#define PIN_EBI_NRD_ATTR       PIO_PULLUP
/*! EBI NWE pin */
#define PIN_EBI_NWE            PIO_PC18_IDX
#define PIN_EBI_NWE_FLAGS      (PIO_PERIPH_A | PIO_PULLUP)
#define PIN_EBI_NWE_MASK       (1 << 18)
#define PIN_EBI_NWE_PIO        PIOC
#define PIN_EBI_NWE_ID         ID_PIOC
#define PIN_EBI_NWE_TYPE       PIO_PERIPH_A
#define PIN_EBI_NWE_ATTR       PIO_PULLUP
/*! EBI NCS0 pin */
#define PIN_EBI_NCS0           PIO_PA6_IDX
#define PIN_EBI_NCS0_FLAGS     (PIO_PERIPH_B | PIO_PULLUP)
#define PIN_EBI_NCS0_MASK      (1 << 6)
#define PIN_EBI_NCS0_PIO       PIOA
#define PIN_EBI_NCS0_ID        ID_PIOA
#define PIN_EBI_NCS0_TYPE      PIO_PERIPH_B
#define PIN_EBI_NCS0_ATTR      PIO_PULLUP
/*! EBI address bus pins */
#define PIN_EBI_ADDR_BUS_A0    PIO_PC21_IDX
#define PIN_EBI_ADDR_BUS_NBS0  PIO_PC21_IDX
#define PIN_EBI_ADDR_BUS_A1    PIO_PC22_IDX
#define PIN_EBI_ADDR_BUS_NBS1  PIO_PD10_IDX
#define PIN_EBI_ADDR_BUS_A2    PIO_PC23_IDX
#define PIN_EBI_ADDR_BUS_A3    PIO_PC24_IDX
#define PIN_EBI_ADDR_BUS_A4    PIO_PC25_IDX
#define PIN_EBI_ADDR_BUS_A5    PIO_PC26_IDX
#define PIN_EBI_ADDR_BUS_A6    PIO_PC27_IDX
#define PIN_EBI_ADDR_BUS_A7    PIO_PC28_IDX
#define PIN_EBI_ADDR_BUS_A8    PIO_PC29_IDX
#define PIN_EBI_ADDR_BUS_A9    PIO_PC30_IDX
#define PIN_EBI_ADDR_BUS_A10   PIO_PD0_IDX
#define PIN_EBI_ADDR_BUS_A11   PIO_PD1_IDX
#define PIN_EBI_ADDR_BUS_A12   PIO_PD2_IDX
#define PIN_EBI_ADDR_BUS_A13   PIO_PD3_IDX
#define PIN_EBI_ADDR_BUS_A14   PIO_PD4_IDX
#define PIN_EBI_ADDR_BUS_A15   PIO_PD5_IDX
#define PIN_EBI_ADDR_BUS_A16   PIO_PD6_IDX
#define PIN_EBI_ADDR_BUS_A17   PIO_PD7_IDX
#define PIN_EBI_ADDR_BUS_FLAG1 (PIO_PERIPH_A | PIO_PULLUP)
#define PIN_EBI_ADDR_BUS_A18   PIO_PA25_IDX
#define PIN_EBI_ADDR_BUS_A19   PIO_PA26_IDX
#define PIN_EBI_ADDR_BUS_A20   PIO_PA27_IDX
#define PIN_EBI_ADDR_BUS_FLAG2 (PIO_PERIPH_B | PIO_PULLUP)
/*! EBI pin for LCD CS */
#define PIN_EBI_NCS2           PIO_PB24_IDX
#define PIN_EBI_NCS2_FLAGS     (PIO_PERIPH_B | PIO_PULLUP)
#define PIN_EBI_NCS2_MASK      (1 << 24)
#define PIN_EBI_NCS2_PIO       PIOB
#define PIN_EBI_NCS2_ID        ID_PIOB
#define PIN_EBI_NCS2_TYPE      PIO_PERIPH_B
#define PIN_EBI_NCS2_ATTR      PIO_PULLUP
/*! EBI pin for LCD RS */
#define PIN_EBI_LCD_RS         PIO_PC22_IDX
#define PIN_EBI_LCD_RS_FLAGS   (PIO_PERIPH_A | PIO_PULLUP)
#define PIN_EBI_LCD_RS_MASK    (1 << 22)
#define PIN_EBI_LCD_RS_PIO     PIOC
#define PIN_EBI_LCD_RS_ID      ID_PIOC
#define PIN_EBI_LCD_RS_TYPE    PIO_PERIPH_A
#define PIN_EBI_LCD_RS_ATTR    PIO_PULLUP

/**
 * \file
 * LEDs
 * - \ref PIN_USER_LED1
 * - \ref PIN_USER_LED2
 * - \ref PIN_USER_LED3
 * - \ref PIN_POWER_LED
 *
 */

/* ------------------------------------------------------------------------ */
/* LEDS                                                                     */
/* ------------------------------------------------------------------------ */
/*! LED #0 pin definition (BLUE). */
#define LED_0_NAME      "blue LED D4"
#define LED0_GPIO       (PIO_PC29_IDX)
#define LED0_FLAGS      (PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT)
#define LED0_ACTIVE_LEVEL 0

#define PIN_LED_0       {PIO_PC29, PIOC, ID_PIOC, PIO_OUTPUT_0, PIO_DEFAULT}
#define PIN_LED_0_MASK  PIO_PC29
#define PIN_LED_0_PIO   PIOC
#define PIN_LED_0_ID    ID_PIOC
#define PIN_LED_0_TYPE  PIO_OUTPUT_1
#define PIN_LED_0_ATTR  PIO_DEFAULT

