jpietari/VME-SAM3X/src/ASF/sam/boards/sam3x_evm300/sam3x_evm300.h
/*! TWI ID for EEPROM application to use */
#define BOARD_ID_TWI_EEPROM         ID_TWI0
/*! TWI Base for TWI EEPROM application to use */
#define BOARD_BASE_TWI_EEPROM       TWI0
/*! TWI Data pin for EEPROM */
#define BOARD_DATA_TWI_EEPROM       TWI0_DATA_GPIO
#define BOARD_DATA_TWI_MUX_EEPROM   IOPORT_MODE_MUX_A
/*! TWI Clock pin for EEPROM */
#define BOARD_CLK_TWI_EEPROM        TWI0_CLK_GPIO
#define BOARD_CLK_TWI_MUX_EEPROM    IOPORT_MODE_MUX_A

/* ------------------------------------------------------------------------ */
#define CONSOLE_UART               UART
#define CONSOLE_UART_ID            ID_UART

/* RE pin. */
#define PIN_RE_IDX                 PIN_USART0_CTS_IDX
#define PIN_RE_FLAGS               (PIO_OUTPUT_0 | PIO_DEFAULT)

/* IRDA SD pin. */
#define PIN_IRDA_SD_IDX            PIN_USART0_CTS_IDX
#define PIN_IRDA_SD_FLAGS          (PIO_OUTPUT_1 | PIO_DEFAULT)

/* TXD pin configuration. */
#define PIN_USART_TXD_IDX          PIN_USART0_TXD_IDX
#define PIN_USART_TXD_FLAGS        (PIO_PERIPH_A | PIO_DEFAULT)
#define PIN_USART_TXD_IO_FLAGS     (PIO_OUTPUT_0 | PIO_DEFAULT)

/* ISO7816 example relate PIN definition. */
#define ISO7816_USART_ID           ID_USART0
#define ISO7816_USART              USART0
#define PIN_ISO7816_RST_IDX        PIO_PA15_IDX
#define PIN_ISO7816_RST_FLAG       (PIO_OUTPUT_0 | PIO_DEFAULT)

/** Usart Used for LIN Support */
#define USART_LIN_NODE0_INSTANCE                        USART0

/* WM8731 Slave address */
#define WM8731_SLAVE_ADDRESS        0x1b

/** TWI interface for WM8731 */
#define TWI_WM8731  TWI0

#endif  /* _SAM3X_EVM300_H_ */
